cases/chpt4-ss304-6/constant/velProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sourceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//sourceVel (-0.00071377 0 0);
sourceVel (0 0 0);
sourcePos0 (0.002 0 0.00125);
sourceOmega 0.00005;
sourcePenn 0.0001;
sourceStartTime 4;
sourcePauseTime 10;
sourceEndTime 10;
sourcePower (0 0 -1000);//4.97e5;//4.9e5; // 4.875e5 fails
sourceC_C 1;
sourceFieldCut 0.999;

sourcePause 1000;
sourceOn false;
oneMeter 1;